app/Controllers/ScheduleController.php

    public function getByMovieId($movieId = null) // hàm lấy danh sách lịch chiếu cụ thể 1 phim
    {
        // kiểm tra ID đầu vào
        if ($movieId === null) {
            return $this->fail('Yêu cầu cung cấp ID của phim.', 400); // 400 = Bad Request
        }

        $model = new ScheduleModel(); // khởi tạo đối tượng model lịch chiếu


        $schedules = $model
            ->select('schedules.id, schedules.start_time, schedules.price, rooms.name as room_name, cinemas.name as cinema_name, cinemas.location')
            ->join('rooms', 'rooms.id = schedules.room_id')
            ->join('cinemas', 'cinemas.id = rooms.cinema_id')
            ->where('schedules.movie_id', $movieId)
            // ->where('schedules.start_time >=', date('Y-m-d H:i:s')) // Tùy chọn: chỉ lấy các suất chiếu trong tương lai
            ->orderBy('schedules.start_time', 'ASC') // Sắp xếp theo thời gian bắt đầu
            ->findAll();
---
SELECT `schedules`.`id`, `schedules`.`start_time`, `schedules`.`price`, `rooms`.`name` as `room_name`, `cinemas`.`name` as `cinema_name`, `cinemas`.`location`
FROM `schedules`
JOIN `rooms` ON `rooms`.`id` = `schedules`.`room_id`
JOIN `cinemas` ON `cinemas`.`id` = `rooms`.`cinema_id`
WHERE `schedules`.`movie_id` = '3'
ORDER BY `schedules`.`start_time` ASC

        public function getByCinema($cinemaId = null) // hàm lấy danh sách lịch chiếu cụ thể 1 rạp
    {
        if ($cinemaId === null) {
            return $this->fail('Yêu cầu cung cấp ID của rạp.', 400);
        }

        $model = new ScheduleModel();
        $request = service('request');

        // Bắt đầu xây dựng câu truy vấn
        $builder = $model
            ->select('schedules.id, schedules.start_time, schedules.price, movies.title as movie_title, movies.poster_url, rooms.name as room_name')
            ->join('movies', 'movies.id = schedules.movie_id')
            ->join('rooms', 'rooms.id = schedules.room_id')
            ->where('rooms.cinema_id', $cinemaId)
            ->orderBy('schedules.start_time', 'ASC');

        // Kiểm tra xem có tham số 'date' trên URL không
        $date = $request->getGet('date');
        if ($date) {
            // Nếu có, thêm điều kiện lọc theo ngày
            // like('cột', 'giá trị', 'after') nghĩa là cột phải BẮT ĐẦU bằng giá trị đó
            // Ví dụ: '2025-12-25 19:00:00' sẽ khớp với '2025-12-25'
            $builder->like('schedules.start_time', $date, 'after');
        }

        // Thực thi câu truy vấn đã xây dựng
        $schedules = $builder->findAll();
---
SELECT `schedules`.`id`, `schedules`.`start_time`, `schedules`.`price`, `movies`.`title` as `movie_title`, `movies`.`poster_url`, `rooms`.`name` as `room_name`
FROM `schedules`
JOIN `movies` ON `movies`.`id` = `schedules`.`movie_id`
JOIN `rooms` ON `rooms`.`id` = `schedules`.`room_id`
WHERE `rooms`.`cinema_id` = '1'
AND  `schedules`.`start_time` LIKE '2025-12-26%' ESCAPE '!'
ORDER BY `schedules`.`start_time` ASC